DataProcessors/ЗаполнениеМалоценкиПоОстаткам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеМалоценкиПоОстаткам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОбъект</Name>
					<Comment>Документ для которого необходимо заполнение</Comment>
					<Type>
						<v8:Type>cfg:DocumentObject.ПеремещениеМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentObject.СписаниеМалоценкиИзЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаМалоценки</Name>
					<Comment>Таблица, для которой требуется заполнение</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительЗапроса</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>cfg:Filter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПартииМалоценкиВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииМалоценкиВЭксплуатации</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияМалоценкиВЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаМалоценкиВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Catalogs/НазначенияИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НазначенияИспользования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМалоценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМалоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПередачиБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетАмортизацииБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬНалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБУДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеМалоценкиПоОстаткам/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ 
// 

// Хранит признак ДокОбъекта "Указывать партию"
Перем  мУказыватьПартию;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

// Процедура перегружает значения отбора
// из реквизита обработки "Отбор"
// в отбор построителя запроса
// 
Процедура СкопироватьОтбор(ОтборИсточник, ОтборПриемник, ТолькоИспользуемые = Ложь) Экспорт
	
	// Очистка отбора приемника
	КвоЭлементов = ОтборПриемник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
	
		ОтборПриемник.Удалить(КвоЭлементов - Н);	
	
	КонецЦикла;
	
	// Загрузка элементов отбора
	КвоЭлементов = ОтборИсточник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
		
		ОбратныйИндекс = КвоЭлементов - Н;
		Элемент        = ОтборИсточник[ОбратныйИндекс];
		
		Если (НЕ ТолькоИспользуемые) ИЛИ Элемент.Использование Тогда
			
			Если ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
				
				ЭлементПриемника = ОтборПриемник.Добавить(Элемент.ПутьКДанным);
				
			Иначе
				
				ЭлементПриемника = Неопределено;
				
			КонецЕсли;
			
			Если ЭлементПриемника <> Неопределено Тогда
				
				Попытка
				
					ЭлементПриемника.ВидСравнения  = Элемент.ВидСравнения;
					ЭлементПриемника.Значение	   = Элемент.Значение;
					ЭлементПриемника.ЗначениеС	   = Элемент.ЗначениеС;
					ЭлементПриемника.ЗначениеПо	   = Элемент.ЗначениеПо;
					ЭлементПриемника.Использование = Элемент.Использование;
					
				
				Исключение
					
					ОбщегоНазначения.СообщитьОбОшибке("Элемент отбора <" + Элемент + ">:" + Символы.ПС + Символы.Таб + ОписаниеОшибки()
					                 + Символы.ПС + Символы.Таб + "Элемент удален.");
					
					ОтборПриемник.Удалить(ОтборПриемник.Индекс(ЭлементПриемника));
					ОтборИсточник.Удалить(ОбратныйИндекс);
					
				КонецПопытки;
				
			Иначе
				
				ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Элемент отбора <¤1¤> не входит в число допустимых."
"	Элемент удален.", Элемент));
				ОтборИсточник.Удалить(ОбратныйИндекс);
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура ВыполнитьЗаполнение() Экспорт

	ЭтоДокПеремещение = (ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеМалоценкиВЭксплуатации"));
	
	// Перегрузка значений из реквизита формы "Отбор"
	// в отбор построителя запроса
	СкопироватьОтбор(Отбор, ПостроительЗапроса.Отбор, Истина);
	
	Заголовок = Локализация.СтрШаблон1("Заполнение табличной части ""¤1¤"" документа ¤2¤.", Метаданные.НайтиПоТипу(ТипЗнч(ТаблицаМалоценки)).Представление(), ДокОбъект);
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьИнформацию("Нет данных для заполнения!", Заголовок);	
		                                                                              
	КонецЕсли;
	
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаМалоценки.Добавить();
		НоваяСтрока.Номенклатура            	= Выборка.Номенклатура;
		НоваяСтрока.ФизЛицо 	   				= Выборка.ФизЛицо;
		НоваяСтрока.НазначениеИспользования 	= Выборка.НазначениеИспользования;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.СерияНоменклатуры          	= Выборка.СерияНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения	   	   	= Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент     	   	  	 = Выборка.Коэффициент;
		
		Если Выборка.Количество < 0 Тогда
			
			НоваяСтрока.Количество 	   = 0;
			Сообщение = "Строка номер " + НоваяСтрока.НомерСтроки  
			            + Символы.ПС + Выборка.ФизЛицо + ", "
						//+ Выборка.Номенклатура + ", " 
						+ Символы.ПС + УправлениеЗапасами.ПредставлениеНоменклатуры(Строка(Выборка.Номенклатура),
																 Строка(Выборка.ХарактеристикаНоменклатуры),
																 Строка(Выборка.СерияНоменклатуры))
						+ Выборка.НазначениеИспользования + ":"
						+ Символы.ПС + Символы.Таб + "Отрицательные остатки <" 
						+ Выборка.Количество + " " + Выборка.ЕдиницаИзмерения +">!";
			
			ОбщегоНазначения.СообщитьОбОшибке(Сообщение, , Заголовок);
			
		Иначе
			
			НоваяСтрока.Количество = Выборка.Количество;
			
		КонецЕсли;
		
		Если мУказыватьПартию Тогда
			
			НоваяСтрока.ПартияМалоценкиВЭксплуатации = Выборка.ПартияМалоценкиВЭксплуатации;
			
		КонецЕсли;
		
		Если ЭтоДокПеремещение Тогда
			
			НоваяСтрока.НазначениеИспользованияНовое = Выборка.НазначениеИспользования;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // СформироватьОтчет()
                                                                                                    
// Процедура - заполняет начальные настройки заполнения
//
Процедура ЗаполнитьНачальныеНастройки(Отказ) Экспорт
	
	Если ТаблицаМалоценки = Неопределено Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Данная обработка служебная и вызывается при необходимости заполнить табличную часть документов по остаткам", Отказ);
		Возврат
		
	КонецЕсли;
	
	УУ = ДокОбъект.ОтражатьВУправленческомУчете;
	БУ = ДокОбъект.ОтражатьВБухгалтерскомУчете;
	
	мУказыватьПартию = ДокОбъект.УказыватьПартию;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	Если ДокОбъект.ЭтоНовый() Тогда
		
		ПостроительЗапроса.Параметры.Вставить("НаДату", Неопределено);
		
	Иначе
		
		ПостроительЗапроса.Параметры.Вставить("НаДату", ДокОбъект.МоментВремени());
		
	КонецЕсли;
	
	ПостроительЗапроса.Параметры.Вставить("ДатаДокумента"           , ДокОбъект.Дата);
	ПостроительЗапроса.Параметры.Вставить("Организация"             , ДокОбъект.Организация);
	ПостроительЗапроса.Параметры.Вставить("Подразделение"           , ДокОбъект.Подразделение);
	ПостроительЗапроса.Параметры.Вставить("ПодразделениеОрганизации", ДокОбъект.ПодразделениеОрганизации);
	ПостроительЗапроса.Параметры.Вставить("СчетМЦ"                  , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
	
	МассивСубконто = Новый Массив(3);
	МассивСубконто[0] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций;
	МассивСубконто[1] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования;
	МассивСубконто[2] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМалоценкиВЭксплуатации;
	ПостроительЗапроса.Параметры.Вставить("СубконтоМЦ", МассивСубконто);
	
	Если УУ Тогда
		
		ПостроительЗапроса.Текст = "
		|	 ВЫБРАТЬ
		|		ПартииУУ.ФизЛицо                    КАК ФизЛицо,
		|		ПартииУУ.Номенклатура               КАК Номенклатура,
		|		ПартииУУ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		ПартииУУ.СерияНоменклатуры          КАК СерияНоменклатуры,
		|		ПартииУУ.НазначениеИспользования    КАК НазначениеИспользования,
		|		ПартииУУ.ПартияМалоценкиВЭксплуатации КАК ПартияМалоценкиВЭксплуатации,
		|		СУММА(ПартииУУ.КоличествоОстаток)   КАК Количество,
		|		ПартииУУ.Номенклатура.ЕдиницаХраненияОстатков   			КАК ЕдиницаИзмерения,
		|		ПартииУУ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент 	КАК Коэффициент
		|	{ВЫБРАТЬ
		|		Номенклатура,
		|		ХарактеристикаНоменклатуры,
		|		СерияНоменклатуры,
		|		ПартияМалоценкиВЭксплуатации,
		|		ФизЛицо,
		|		НазначениеИспользования,
		|		Качество}
		|	ИЗ
		|		РегистрНакопления.ПартииМалоценкиВЭксплуатации.Остатки(&НаДату, 
		|		                  Подразделение = &Подразделение
		|		                  {Номенклатура.*               КАК Номенклатура,
		|		                   ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
		|		                   СерияНоменклатуры.*          КАК СерияНоменклатуры,
		|		                   ПартияМалоценкиВЭксплуатации.*           КАК ПартияМалоценкиВЭксплуатации,
		|		                   ФизЛицо.*                    КАК ФизЛицо,
		|		                   НазначениеИспользования.*    КАК НазначениеИспользования,
		|							ВЫБОР
		|								КОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПартияМалоценкиВЭксплуатации.Дата,ДЕНЬ), МЕСЯЦ, НазначениеИспользования.СрокПолезногоИспользования) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
		|								ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ КАК СИстекшимСроком,
		|		                   РАЗНОСТЬДАТ(ПартияМалоценкиВЭксплуатации.Дата, &ДатаДокумента, МЕСЯЦ) КАК СрокВЭксплуатации,
		|		                   НАЧАЛОПЕРИОДА(ПартияМалоценкиВЭксплуатации.Дата, ДЕНЬ)                КАК ДатаПередачи,
		|		                   ДокументОприходования.*      КАК ДокументОприходования}) КАК ПартииУУ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПартииУУ.ФизЛицо,
		|		ПартииУУ.Номенклатура,
		|		ПартииУУ.ХарактеристикаНоменклатуры,
		|		ПартииУУ.СерияНоменклатуры,
		|		ПартииУУ.ПартияМалоценкиВЭксплуатации,
		|		ПартииУУ.НазначениеИспользования,
		|		ПартииУУ.Качество
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	Номенклатура,
		|	НазначениеИспользования,
		|	ПартияМалоценкиВЭксплуатации";
		
		
	Иначе
		
		ПостроительЗапроса.Текст = "
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1                             КАК ФизЛицо,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 
		|	         КАК Справочник.НазначенияИспользования).Владелец КАК Номенклатура,
		|	NULL 													  КАК ХарактеристикаНоменклатуры,
		|	NULL 													  КАК СерияНоменклатуры,
		|	ХозрасчетныйОстатки.Субконто2                             КАК НазначениеИспользования,
		|	ХозрасчетныйОстатки.Субконто3                             КАК ПартияМалоценкиВЭксплуатации,
		|	ХозрасчетныйОстатки.КоличествоОстатокДт                   КАК Количество,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 
		|	              КАК Справочник.НазначенияИспользования).Владелец.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 
		|	              КАК Справочник.НазначенияИспользования).Владелец.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент
		|{ВЫБРАТЬ
		|	ФизЛицо,
		|	Номенклатура,
		|	НазначениеИспользования,
		|	ПартияМалоценкиВЭксплуатации,
		|	Количество,
		|	ЕдиницаИзмерения}
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|		               &НаДату,
		|		               Счет = &СчетМЦ,
		|		               &СубконтоМЦ,
		|		               Организация = &Организация
		|		               И Субконто3.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|		               {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ФизическиеЛица).*                  КАК ФизЛицо,
		|		               ВЫРАЗИТЬ(Субконто2 КАК Справочник.НазначенияИспользования).Владелец.* КАК Номенклатура,
		|		               ВЫРАЗИТЬ(Субконто2 КАК Справочник.НазначенияИспользования).*          КАК НазначениеИспользования,
		|		               Субконто3                                                             КАК ПартияМалоценкиВЭксплуатации,
		|						ВЫБОР
		|							КОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Субконто3.Дата,ДЕНЬ), МЕСЯЦ, Субконто2.СрокПолезногоИспользования) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
		|							ТОГДА ИСТИНА
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ КАК СИстекшимСроком,
		|		               РАЗНОСТЬДАТ(Субконто3.Дата, &ДатаДокумента, МЕСЯЦ)                    КАК СрокВЭксплуатации,
		|		               НАЧАЛОПЕРИОДА(Субконто3.Дата, ДЕНЬ) КАК ДатаПередачи}) КАК ХозрасчетныйОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	Номенклатура,
		|	НазначениеИспользования,
		|	ПартияМалоценкиВЭксплуатации";
		
	
	КонецЕсли;	
		
	ДоступныеПоля = ПостроительЗапроса.ДоступныеПоля;
	
	// Заполнение пользовательских представлений для доступных полей
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Номенклатура"					, "Малоценный актив");
	СтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры"	, "Характеристика номенклатуры");
	СтруктураПредставлениеПолей.Вставить("СерияНоменклатуры"         	, "Серия номенклатуры");
	СтруктураПредставлениеПолей.Вставить("ПартияМалоценкиВЭксплуатации"	, "Партия малоценки в эксплуатации");
	СтруктураПредставлениеПолей.Вставить("ДатаПередачи"              	, "Дата передачи в эксплуатацию");
	СтруктураПредставлениеПолей.Вставить("СрокВЭксплуатации"         	, "Месяцев в эксплуатации на дату документа");
	СтруктураПредставлениеПолей.Вставить("ФизЛицо"                   	, "Работник");
	СтруктураПредставлениеПолей.Вставить("НазначениеИспользования"   	, "Назначение использования");
	СтруктураПредставлениеПолей.Вставить("СИстекшимСроком"         	 	, "С истёкшим сроком");
	
	Для каждого КлючЗначение Из СтруктураПредставлениеПолей Цикл
		
		Поле = ДоступныеПоля.Найти(КлючЗначение.Ключ);
		
		Если Поле <> Неопределено  Тогда
			
			Поле.Представление = КлючЗначение.Значение;			
			
		КонецЕсли;		
	
	КонецЦикла;
	
	Если НЕ мУказыватьПартию Тогда
		
		// Нужно удалить из выбраных полей ДокументПередачи
		ИзмерениеДокументПередачи = ПостроительЗапроса.ВыбранныеПоля.Найти("ПартияМалоценкиВЭксплуатации");
		
		Если ИзмерениеДокументПередачи <> Неопределено Тогда
			
			 ПостроительЗапроса.ВыбранныеПоля.Удалить(ИзмерениеДокументПередачи);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// заполнение доступных полей для реквизита обработки
	Отбор.УстановитьДоступныеПоля(ДоступныеПоля);
	
	// поля по умолчанию                                                                
	Отбор.Добавить("Номенклатура");
	Отбор.Добавить("ФизЛицо");
	Отбор.Добавить("ДатаПередачи"                                      , , "Дата передачи в эксплуатацию");
	Отбор.Добавить("СрокВЭксплуатации"                                 , , "Месяцев в эксплуатации на дату документа");
	Отбор.Добавить("НазначениеИспользования.СрокПолезногоИспользования", , "Срок полезного использования");
	Отбор.Добавить("СИстекшимСроком"                                   , , "С истёкшим сроком");
	
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()
